us_parks_api/app/controllers/parks_controller.rb

SELECT "parks".* FROM "parks"
---
  def index
    @parks = Park.all

INSERT INTO "parks" ("name", "description", "location", "avg_visitors", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @park = Park.new(park_params)

    if @park.save

UPDATE "parks" SET "name" = $1, "updated_at" = $2 WHERE "parks"."id" = $3  [["name", "Nickerson State Parkkkkkkk"], ["updated_at", "2020-09-24 18:59:35.374006"], ["id", 10]]
---
  def update
    if @park.update(park_params)

DELETE FROM "parks" WHERE "parks"."id" = $1  [["id", 10]]
---
  def destroy
    @park.destroy

SELECT "parks".* FROM "parks" WHERE "parks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_park
      @park = Park.find(params[:id])